/********************************************************************************
* Copyright (c) 2015,联创中控（北京）科技有限公司
* All rights reserved.
*
* 文件名称：sensor.c
* 摘    要：获取通道值，并返回;
* 当前版本: V1.1
* 作    者：UICollege
* 修改摘要: 
********************************************************************************/

#include"main.h"
/**************************************************************************
	函数名          ：GetInput();
	输入参数 channel: 通道号;
	输出参数        ：端口值，取值范围【0,1】
	功能            ：获取传感器采样值；
***************************************************************************/
uint8_t GetInput(uint8_t  channel)
{
	return((GPIO_ReadInputDataBit(GPIOB, (1 << channel)) == 1));
}

/**************************************************************************
	函数名          ：SetOutput();
	输入参数 channel: 通道号;
	输入参数 value  ：取值范围【0,1】
	功能            ：对端口置0或置1
***************************************************************************/
void SetOutput(uint8_t channel, uint8_t value)
{
	
}

/**********************end_file@*****************************************/

